testing-scripts/test_multi-client_unencrypted_h2load_throughput_via-B/results/payload-size_1000000____delay-ms_1____loss-rate-percent_0.01____clients-requests_10/1/result.txt
Setting null encryption
starting benchmark...
spawning thread #0: 10 total client(s). 10 total requests
[WARNING! Using Null-encryption]
[WARNING! Using Null-encryption]
[WARNING! Using Null-encryption]
[...]
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: h3
progress: 10% done
progress: 20% done
progress: 30% done
progress: 40% done
progress: 50% done
progress: 60% done
progress: 70% done
progress: 80% done
progress: 90% done
progress: 100% done

finished in 73.98ms, 135.17 req/s, 128.95MB/s
requests: 10 total, 10 started, 10 done, 10 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 10 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 9.54MB (10003820) total, 120B (120) headers (space savings 87.23%), 9.54MB (10000000) data
UDP datagram: 687 sent, 8248 received
                     min         max         mean         sd        +/- sd
time for request:    44.44ms     64.21ms     54.83ms      6.48ms    70.00%
time for connect:     6.19ms     27.79ms     16.84ms      7.30ms    60.00%
time to 1st byte:    27.45ms     30.77ms     28.84ms      1.08ms    60.00%
req/s           :      13.63       14.38       13.94        0.24    60.00%